In [1]:
import numpy as np
import pandas as pd

In [6]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3] }

In [7]:
df = pd.DataFrame(d)

In [9]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Drop DataFrame

In [11]:
# by default, rows are dropped with Nan value
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
# if axis=1 then, columns are dropped with Nan value
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [21]:
# thresh : int, optional; Require that many non-NA values
# For this example dropped that at least 2 Nan values
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#### Fill DataFrame

In [25]:
df.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [26]:
# fill missing values with mean value
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64